results-shopcart-jvm/run_2_2026-01-05_01-17-09/FIXED-800-latency-1-dump.txt
Running 30s test @ http://127.0.0.1:8001
  16 threads and 16 connections
  Thread calibration: mean lat.: 1.505ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.351ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.442ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.258ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.258ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.283ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.228ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.301ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.331ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.235ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.325ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.267ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.261ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.284ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.276ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.239ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.87ms  360.62us   7.52ms   71.43%
    Req/Sec    51.69     51.33   111.00     88.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.86ms
 75.000%    1.11ms
 90.000%    1.27ms
 99.000%    1.45ms
 99.900%    4.60ms
 99.990%    6.78ms
 99.999%    7.52ms
100.000%    7.52ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.135     0.000000            1         1.00
       0.450     0.100000         1602         1.11
       0.552     0.200000         3199         1.25
       0.649     0.300000         4811         1.43
       0.753     0.400000         6406         1.67
       0.862     0.500000         8001         2.00
       0.919     0.550000         8792         2.22
       0.971     0.600000         9601         2.50
       1.018     0.650000        10404         2.86
       1.060     0.700000        11196         3.33
       1.108     0.750000        12007         4.00
       1.131     0.775000        12407         4.44
       1.155     0.800000        12789         5.00
       1.183     0.825000        13192         5.71
       1.210     0.850000        13598         6.67
       1.238     0.875000        13986         8.00
       1.254     0.887500        14197         8.89
       1.269     0.900000        14395        10.00
       1.287     0.912500        14591        11.43
       1.307     0.925000        14786        13.33
       1.327     0.937500        14986        16.00
       1.338     0.943750        15093        17.78
       1.350     0.950000        15185        20.00
       1.362     0.956250        15289        22.86
       1.373     0.962500        15394        26.67
       1.383     0.968750        15487        32.00
       1.389     0.971875        15542        35.56
       1.395     0.975000        15588        40.00
       1.403     0.978125        15638        45.71
       1.414     0.981250        15688        53.33
       1.424     0.984375        15735        64.00
       1.431     0.985938        15761        71.11
       1.440     0.987500        15787        80.00
       1.450     0.989062        15813        91.43
       1.460     0.990625        15835       106.67
       1.479     0.992188        15862       128.00
       1.487     0.992969        15874       142.22
       1.506     0.993750        15886       160.00
       1.526     0.994531        15897       182.86
       1.541     0.995313        15910       213.33
       1.579     0.996094        15922       256.00
       1.604     0.996484        15928       284.44
       1.757     0.996875        15935       320.00
       1.814     0.997266        15941       365.71
       2.597     0.997656        15947       426.67
       2.999     0.998047        15953       512.00
       3.343     0.998242        15956       568.89
       3.851     0.998437        15960       640.00
       4.155     0.998633        15963       731.43
       4.383     0.998828        15966       853.33
       4.635     0.999023        15969      1024.00
       4.667     0.999121        15970      1137.78
       4.979     0.999219        15972      1280.00
       5.119     0.999316        15974      1462.86
       5.475     0.999414        15975      1706.67
       5.515     0.999512        15977      2048.00
       5.515     0.999561        15977      2275.56
       5.727     0.999609        15978      2560.00
       6.179     0.999658        15979      2925.71
       6.195     0.999707        15980      3413.33
       6.603     0.999756        15981      4096.00
       6.603     0.999780        15981      4551.11
       6.603     0.999805        15981      5120.00
       6.779     0.999829        15982      5851.43
       6.779     0.999854        15982      6826.67
       7.447     0.999878        15983      8192.00
       7.447     0.999890        15983      9102.22
       7.447     0.999902        15983     10240.00
       7.447     0.999915        15983     11702.86
       7.447     0.999927        15983     13653.33
       7.519     0.999939        15984     16384.00
       7.519     1.000000        15984          inf
#[Mean    =        0.866, StdDeviation   =        0.361]
#[Max     =        7.516, Total count    =        15984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24016 requests in 30.00s, 7.17MB read
Requests/sec:    800.49
Transfer/sec:    244.77KB